hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_vsc_regs.h
/*
 * Copyright (c) 2021-2025 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_VSC_H
#define HPM_VSC_H

typedef struct {
    __RW uint32_t ABC_MODE;                    /* 0x0: abc mode */
    __RW uint32_t ADC_CHAN_ASSIGN;             /* 0x4: assign adc_chan for value_a/b/c */
    __RW uint32_t VALUE_A_DATA_OPT;            /* 0x8: value_a data operation mode */
    __R  uint8_t  RESERVED0[4];                /* 0xC - 0xF: Reserved */
    __RW uint32_t VALUE_B_DATA_OPT;            /* 0x10: value_b data operation mode */
    __R  uint8_t  RESERVED1[4];                /* 0x14 - 0x17: Reserved */
    __RW uint32_t VALUE_C_DATA_OPT;            /* 0x18: value_c data operation mode */
    __R  uint8_t  RESERVED2[4];                /* 0x1C - 0x1F: Reserved */
    __RW uint32_t VALUE_A_OFFSET;              /* 0x20: value_a offset */
    __RW uint32_t VALUE_B_OFFSET;              /* 0x24: value_b_offset */
    __RW uint32_t VALUE_C_OFFSET;              /* 0x28: value_c offset */
    __RW uint32_t IRQ_STATUS;                  /* 0x2C: irq status */
    __RW uint32_t VALUE_A_SW;                  /* 0x30: value_a software inject value */
    __RW uint32_t VALUE_B_SW;                  /* 0x34: value_b software inject value */
    __RW uint32_t VALUE_C_SW;                  /* 0x38: value_c software inject value */
    __W  uint32_t VALUE_SW_READY;              /* 0x3C: software inject value_a/value_b/value_c ready */
    __W  uint32_t TRIGGER_SW;                  /* 0x40: software trigger event */
    __RW uint32_t TIMELOCK;                    /* 0x44: timestamp mode and postion capture ctrl */
    __RW uint32_t POSITION_SW;                 /* 0x48: position software inject value */
    __RW uint32_t ADC_WAIT_CYCLE;              /* 0x4C: adc wait cycle after trigger adc capture event */
    __RW uint32_t POS_WAIT_CYCLE;              /* 0x50: pos wait cycle after trigger adc capture event */
    __RW uint32_t IRQ_ENABLE;                  /* 0x54: irq bit enable */
    __RW uint32_t ADC_PHASE_TOLERATE;          /* 0x58: adc phase tolerate */
    __RW uint32_t POS_POLE;                    /* 0x5C: position pole num */
    __R  uint8_t  RESERVED3[160];              /* 0x60 - 0xFF: Reserved */
    __R  uint32_t ID_POSEDGE;                  /* 0x100: posedge order Id value */
    __R  uint32_t IQ_POSEDGE;                  /* 0x104: posedge order Iq value */
    __R  uint32_t ID_NEGEDGE;                  /* 0x108: negedge order Id value */
    __R  uint32_t IQ_NEGEDGE;                  /* 0x10C: negedge order Iq value */
    __R  uint32_t ALPHA_POSEDGE;               /* 0x110: posedge order alpha value */
    __R  uint32_t BETA_POSEDGE;                /* 0x114: posedge order beta value */
    __R  uint32_t ALPHA_NEGEDGE;               /* 0x118: negedge order alpha value */
    __R  uint32_t BETA_NEGEDGE;                /* 0x11C: negedge order beta value */
    __R  uint32_t TIMESTAMP_LOCKED;            /* 0x120: timestamp_locked */
    __R  uint32_t DEBUG_STATUS0;               /* 0x124: debug_status0 */
} VSC_Type;


/* Bitfield definition for register: ABC_MODE */
/*
 * PHASE_ABSENT_MODE (RW)
 *
 * whether using value_a and value_b instead of three phase
 */
#define VSC_ABC_MODE_PHASE_ABSENT_MODE_MASK (0x80000000UL)
#define VSC_ABC_MODE_PHASE_ABSENT_MODE_SHIFT (31U)
#define VSC_ABC_MODE_PHASE_ABSENT_MODE_SET(x) (((uint32_t)(x) << VSC_ABC_MODE_PHASE_ABSENT_MODE_SHIFT) & VSC_ABC_MODE_PHASE_ABSENT_MODE_MASK)
#define VSC_ABC_MODE_PHASE_ABSENT_MODE_GET(x) (((uint32_t)(x) & VSC_ABC_MODE_PHASE_ABSENT_MODE_MASK) >> VSC_ABC_MODE_PHASE_ABSENT_MODE_SHIFT)

/*
 * POSTION_USE_LAST_LOCKED (RW)
 *
 * position will not blockage vsc convert. always use last locked position, it should be cfg to 1 when position_capture_mode=2'b00 and adc valure are injected by software;
 */
#define VSC_ABC_MODE_POSTION_USE_LAST_LOCKED_MASK (0x40000000UL)
#define VSC_ABC_MODE_POSTION_USE_LAST_LOCKED_SHIFT (30U)
#define VSC_ABC_MODE_POSTION_USE_LAST_LOCKED_SET(x) (((uint32_t)(x) << VSC_ABC_MODE_POSTION_USE_LAST_LOCKED_SHIFT) & VSC_ABC_MODE_POSTION_USE_LAST_LOCKED_MASK)
#define VSC_ABC_MODE_POSTION_USE_LAST_LOCKED_GET(x) (((uint32_t)(x) & VSC_ABC_MODE_POSTION_USE_LAST_LOCKED_MASK) >> VSC_ABC_MODE_POSTION_USE_LAST_LOCKED_SHIFT)

/*
 * VALUE_C_WIDTH (RW)
 *
 * numbers of value_c for each convert
 */
#define VSC_ABC_MODE_VALUE_C_WIDTH_MASK (0xF000000UL)
#define VSC_ABC_MODE_VALUE_C_WIDTH_SHIFT (24U)
#define VSC_ABC_MODE_VALUE_C_WIDTH_SET(x) (((uint32_t)(x) << VSC_ABC_MODE_VALUE_C_WIDTH_SHIFT) & VSC_ABC_MODE_VALUE_C_WIDTH_MASK)
#define VSC_ABC_MODE_VALUE_C_WIDTH_GET(x) (((uint32_t)(x) & VSC_ABC_MODE_VALUE_C_WIDTH_MASK) >> VSC_ABC_MODE_VALUE_C_WIDTH_SHIFT)

/*
 * VALUE_B_WIDTH (RW)
 *
 * numbers of value_b for each convert
 */
#define VSC_ABC_MODE_VALUE_B_WIDTH_MASK (0xF00000UL)
#define VSC_ABC_MODE_VALUE_B_WIDTH_SHIFT (20U)
#define VSC_ABC_MODE_VALUE_B_WIDTH_SET(x) (((uint32_t)(x) << VSC_ABC_MODE_VALUE_B_WIDTH_SHIFT) & VSC_ABC_MODE_VALUE_B_WIDTH_MASK)
#define VSC_ABC_MODE_VALUE_B_WIDTH_GET(x) (((uint32_t)(x) & VSC_ABC_MODE_VALUE_B_WIDTH_MASK) >> VSC_ABC_MODE_VALUE_B_WIDTH_SHIFT)

/*
 * VALUE_A_WIDTH (RW)
 *
 * numbers of value_a for each convert
 */
#define VSC_ABC_MODE_VALUE_A_WIDTH_MASK (0xF0000UL)
#define VSC_ABC_MODE_VALUE_A_WIDTH_SHIFT (16U)
#define VSC_ABC_MODE_VALUE_A_WIDTH_SET(x) (((uint32_t)(x) << VSC_ABC_MODE_VALUE_A_WIDTH_SHIFT) & VSC_ABC_MODE_VALUE_A_WIDTH_MASK)
#define VSC_ABC_MODE_VALUE_A_WIDTH_GET(x) (((uint32_t)(x) & VSC_ABC_MODE_VALUE_A_WIDTH_MASK) >> VSC_ABC_MODE_VALUE_A_WIDTH_SHIFT)

/*
 * VALUE_C_LOC (RW)
 *
 * the adc index of value_c:
 * 2'b:00: resevered;
 * 2'b:01: from adc0;
 * 2'b:10: from adc1;
 * 2'b:11: from adc2;
 */
#define VSC_ABC_MODE_VALUE_C_LOC_MASK (0x3000U)
#define VSC_ABC_MODE_VALUE_C_LOC_SHIFT (12U)
#define VSC_ABC_MODE_VALUE_C_LOC_SET(x) (((uint32_t)(x) << VSC_ABC_MODE_VALUE_C_LOC_SHIFT) & VSC_ABC_MODE_VALUE_C_LOC_MASK)
#define VSC_ABC_MODE_VALUE_C_LOC_GET(x) (((uint32_t)(x) & VSC_ABC_MODE_VALUE_C_LOC_MASK) >> VSC_ABC_MODE_VALUE_C_LOC_SHIFT)

