hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_vsc_regs.h
/*
 * VALUE_B_LOC (RW)
 *
 * the adc index of value_b:
 * 2'b:00: resevered;
 * 2'b:01: from adc0;
 * 2'b:10: from adc1;
 * 2'b:11: from adc2;
 */
#define VSC_ABC_MODE_VALUE_B_LOC_MASK (0x300U)
#define VSC_ABC_MODE_VALUE_B_LOC_SHIFT (8U)
#define VSC_ABC_MODE_VALUE_B_LOC_SET(x) (((uint32_t)(x) << VSC_ABC_MODE_VALUE_B_LOC_SHIFT) & VSC_ABC_MODE_VALUE_B_LOC_MASK)
#define VSC_ABC_MODE_VALUE_B_LOC_GET(x) (((uint32_t)(x) & VSC_ABC_MODE_VALUE_B_LOC_MASK) >> VSC_ABC_MODE_VALUE_B_LOC_SHIFT)

/*
 * VALUE_A_LOC (RW)
 *
 * the adc index of value_a:
 * 2'b:00: resevered;
 * 2'b:01: from adc0;
 * 2'b:10: from adc1;
 * 2'b:11: from adc2;
 */
#define VSC_ABC_MODE_VALUE_A_LOC_MASK (0x30U)
#define VSC_ABC_MODE_VALUE_A_LOC_SHIFT (4U)
#define VSC_ABC_MODE_VALUE_A_LOC_SET(x) (((uint32_t)(x) << VSC_ABC_MODE_VALUE_A_LOC_SHIFT) & VSC_ABC_MODE_VALUE_A_LOC_MASK)
#define VSC_ABC_MODE_VALUE_A_LOC_GET(x) (((uint32_t)(x) & VSC_ABC_MODE_VALUE_A_LOC_MASK) >> VSC_ABC_MODE_VALUE_A_LOC_SHIFT)

/*
 * ENABLE_VSC (RW)
 *
 * enable vsc convert:
 * 0: disable vsc convert
 * 1: enable vsc convert
 */
#define VSC_ABC_MODE_ENABLE_VSC_MASK (0x8U)
#define VSC_ABC_MODE_ENABLE_VSC_SHIFT (3U)
#define VSC_ABC_MODE_ENABLE_VSC_SET(x) (((uint32_t)(x) << VSC_ABC_MODE_ENABLE_VSC_SHIFT) & VSC_ABC_MODE_ENABLE_VSC_MASK)
#define VSC_ABC_MODE_ENABLE_VSC_GET(x) (((uint32_t)(x) & VSC_ABC_MODE_ENABLE_VSC_MASK) >> VSC_ABC_MODE_ENABLE_VSC_SHIFT)

/* Bitfield definition for register: ADC_CHAN_ASSIGN */
/*
 * VALUE_C_CHAN (RW)
 *
 * value_c's adc chan
 */
#define VSC_ADC_CHAN_ASSIGN_VALUE_C_CHAN_MASK (0x1F0000UL)
#define VSC_ADC_CHAN_ASSIGN_VALUE_C_CHAN_SHIFT (16U)
#define VSC_ADC_CHAN_ASSIGN_VALUE_C_CHAN_SET(x) (((uint32_t)(x) << VSC_ADC_CHAN_ASSIGN_VALUE_C_CHAN_SHIFT) & VSC_ADC_CHAN_ASSIGN_VALUE_C_CHAN_MASK)
#define VSC_ADC_CHAN_ASSIGN_VALUE_C_CHAN_GET(x) (((uint32_t)(x) & VSC_ADC_CHAN_ASSIGN_VALUE_C_CHAN_MASK) >> VSC_ADC_CHAN_ASSIGN_VALUE_C_CHAN_SHIFT)

/*
 * VALUE_B_CHAN (RW)
 *
 * value_b's adc chan
 */
#define VSC_ADC_CHAN_ASSIGN_VALUE_B_CHAN_MASK (0x1F00U)
#define VSC_ADC_CHAN_ASSIGN_VALUE_B_CHAN_SHIFT (8U)
#define VSC_ADC_CHAN_ASSIGN_VALUE_B_CHAN_SET(x) (((uint32_t)(x) << VSC_ADC_CHAN_ASSIGN_VALUE_B_CHAN_SHIFT) & VSC_ADC_CHAN_ASSIGN_VALUE_B_CHAN_MASK)
#define VSC_ADC_CHAN_ASSIGN_VALUE_B_CHAN_GET(x) (((uint32_t)(x) & VSC_ADC_CHAN_ASSIGN_VALUE_B_CHAN_MASK) >> VSC_ADC_CHAN_ASSIGN_VALUE_B_CHAN_SHIFT)

/*
 * VALUE_A_CHAN (RW)
 *
 * value_a's adc chan
 */
#define VSC_ADC_CHAN_ASSIGN_VALUE_A_CHAN_MASK (0x1FU)
#define VSC_ADC_CHAN_ASSIGN_VALUE_A_CHAN_SHIFT (0U)
#define VSC_ADC_CHAN_ASSIGN_VALUE_A_CHAN_SET(x) (((uint32_t)(x) << VSC_ADC_CHAN_ASSIGN_VALUE_A_CHAN_SHIFT) & VSC_ADC_CHAN_ASSIGN_VALUE_A_CHAN_MASK)
#define VSC_ADC_CHAN_ASSIGN_VALUE_A_CHAN_GET(x) (((uint32_t)(x) & VSC_ADC_CHAN_ASSIGN_VALUE_A_CHAN_MASK) >> VSC_ADC_CHAN_ASSIGN_VALUE_A_CHAN_SHIFT)

/* Bitfield definition for register: VALUE_A_DATA_OPT */
/*
 * OPT_3 (RW)
 *
 * 0: PLUS_MUL_1
 * 1: PLUS_MUL_2
 * 5: PLUS_DIV_2
 * 6: PLUS_DIV_3
 * 7: PLUS_DIV_4
 * 8: MINUS MUL 1
 * 9: MINUS MUL 2
 * 13: MINUS DIV 2
 * 14: MINUS DIV 3
 * 15: MINUS DIV 4
 */
#define VSC_VALUE_A_DATA_OPT_OPT_3_MASK (0xF000U)
#define VSC_VALUE_A_DATA_OPT_OPT_3_SHIFT (12U)
#define VSC_VALUE_A_DATA_OPT_OPT_3_SET(x) (((uint32_t)(x) << VSC_VALUE_A_DATA_OPT_OPT_3_SHIFT) & VSC_VALUE_A_DATA_OPT_OPT_3_MASK)
#define VSC_VALUE_A_DATA_OPT_OPT_3_GET(x) (((uint32_t)(x) & VSC_VALUE_A_DATA_OPT_OPT_3_MASK) >> VSC_VALUE_A_DATA_OPT_OPT_3_SHIFT)

/*
 * OPT_2 (RW)
 *
 * 0: PLUS_MUL_1
 * 1: PLUS_MUL_2
 * 5: PLUS_DIV_2
 * 6: PLUS_DIV_3
 * 7: PLUS_DIV_4
 * 8: MINUS MUL 1
 * 9: MINUS MUL 2
 * 13: MINUS DIV 2
 * 14: MINUS DIV 3
 * 15: MINUS DIV 4
 */
#define VSC_VALUE_A_DATA_OPT_OPT_2_MASK (0xF00U)
#define VSC_VALUE_A_DATA_OPT_OPT_2_SHIFT (8U)
#define VSC_VALUE_A_DATA_OPT_OPT_2_SET(x) (((uint32_t)(x) << VSC_VALUE_A_DATA_OPT_OPT_2_SHIFT) & VSC_VALUE_A_DATA_OPT_OPT_2_MASK)
#define VSC_VALUE_A_DATA_OPT_OPT_2_GET(x) (((uint32_t)(x) & VSC_VALUE_A_DATA_OPT_OPT_2_MASK) >> VSC_VALUE_A_DATA_OPT_OPT_2_SHIFT)

/*
 * OPT_1 (RW)
 *
 * 0: PLUS_MUL_1
 * 1: PLUS_MUL_2
 * 5: PLUS_DIV_2
 * 6: PLUS_DIV_3
 * 7: PLUS_DIV_4
 * 8: MINUS MUL 1
 * 9: MINUS MUL 2
 * 13: MINUS DIV 2
 * 14: MINUS DIV 3
 * 15: MINUS DIV 4
 */
#define VSC_VALUE_A_DATA_OPT_OPT_1_MASK (0xF0U)
#define VSC_VALUE_A_DATA_OPT_OPT_1_SHIFT (4U)
#define VSC_VALUE_A_DATA_OPT_OPT_1_SET(x) (((uint32_t)(x) << VSC_VALUE_A_DATA_OPT_OPT_1_SHIFT) & VSC_VALUE_A_DATA_OPT_OPT_1_MASK)
#define VSC_VALUE_A_DATA_OPT_OPT_1_GET(x) (((uint32_t)(x) & VSC_VALUE_A_DATA_OPT_OPT_1_MASK) >> VSC_VALUE_A_DATA_OPT_OPT_1_SHIFT)

/*
 * OPT_0 (RW)
 *
 * 0: PLUS_MUL_1
 * 1: PLUS_MUL_2
 * 5: PLUS_DIV_2
 * 6: PLUS_DIV_3
 * 7: PLUS_DIV_4
 * 8: MINUS MUL 1
 * 9: MINUS MUL 2
 * 13: MINUS DIV 2
 * 14: MINUS DIV 3
 * 15: MINUS DIV 4
 */
#define VSC_VALUE_A_DATA_OPT_OPT_0_MASK (0xFU)
#define VSC_VALUE_A_DATA_OPT_OPT_0_SHIFT (0U)
#define VSC_VALUE_A_DATA_OPT_OPT_0_SET(x) (((uint32_t)(x) << VSC_VALUE_A_DATA_OPT_OPT_0_SHIFT) & VSC_VALUE_A_DATA_OPT_OPT_0_MASK)
#define VSC_VALUE_A_DATA_OPT_OPT_0_GET(x) (((uint32_t)(x) & VSC_VALUE_A_DATA_OPT_OPT_0_MASK) >> VSC_VALUE_A_DATA_OPT_OPT_0_SHIFT)

/* Bitfield definition for register: VALUE_B_DATA_OPT */
/*
 * OPT_3 (RW)
 *
 * 0: PLUS_MUL_1
 * 1: PLUS_MUL_2
 * 5: PLUS_DIV_2
 * 6: PLUS_DIV_3
 * 7: PLUS_DIV_4
 * 8: MINUS MUL 1
 * 9: MINUS MUL 2
 * 13: MINUS DIV 2
 * 14: MINUS DIV 3
 * 15: MINUS DIV 4
 */
#define VSC_VALUE_B_DATA_OPT_OPT_3_MASK (0xF000U)
#define VSC_VALUE_B_DATA_OPT_OPT_3_SHIFT (12U)
#define VSC_VALUE_B_DATA_OPT_OPT_3_SET(x) (((uint32_t)(x) << VSC_VALUE_B_DATA_OPT_OPT_3_SHIFT) & VSC_VALUE_B_DATA_OPT_OPT_3_MASK)
#define VSC_VALUE_B_DATA_OPT_OPT_3_GET(x) (((uint32_t)(x) & VSC_VALUE_B_DATA_OPT_OPT_3_MASK) >> VSC_VALUE_B_DATA_OPT_OPT_3_SHIFT)

/*
 * OPT_2 (RW)
 *
 * 0: PLUS_MUL_1
 * 1: PLUS_MUL_2
 * 5: PLUS_DIV_2
 * 6: PLUS_DIV_3
 * 7: PLUS_DIV_4
 * 8: MINUS MUL 1
 * 9: MINUS MUL 2
 * 13: MINUS DIV 2
 * 14: MINUS DIV 3
 * 15: MINUS DIV 4
 */
#define VSC_VALUE_B_DATA_OPT_OPT_2_MASK (0xF00U)
#define VSC_VALUE_B_DATA_OPT_OPT_2_SHIFT (8U)
#define VSC_VALUE_B_DATA_OPT_OPT_2_SET(x) (((uint32_t)(x) << VSC_VALUE_B_DATA_OPT_OPT_2_SHIFT) & VSC_VALUE_B_DATA_OPT_OPT_2_MASK)
#define VSC_VALUE_B_DATA_OPT_OPT_2_GET(x) (((uint32_t)(x) & VSC_VALUE_B_DATA_OPT_OPT_2_MASK) >> VSC_VALUE_B_DATA_OPT_OPT_2_SHIFT)

