hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_vsc_regs.h
/*
 * OPT_1 (RW)
 *
 * 0: PLUS_MUL_1
 * 1: PLUS_MUL_2
 * 5: PLUS_DIV_2
 * 6: PLUS_DIV_3
 * 7: PLUS_DIV_4
 * 8: MINUS MUL 1
 * 9: MINUS MUL 2
 * 13: MINUS DIV 2
 * 14: MINUS DIV 3
 * 15: MINUS DIV 4
 */
#define VSC_VALUE_B_DATA_OPT_OPT_1_MASK (0xF0U)
#define VSC_VALUE_B_DATA_OPT_OPT_1_SHIFT (4U)
#define VSC_VALUE_B_DATA_OPT_OPT_1_SET(x) (((uint32_t)(x) << VSC_VALUE_B_DATA_OPT_OPT_1_SHIFT) & VSC_VALUE_B_DATA_OPT_OPT_1_MASK)
#define VSC_VALUE_B_DATA_OPT_OPT_1_GET(x) (((uint32_t)(x) & VSC_VALUE_B_DATA_OPT_OPT_1_MASK) >> VSC_VALUE_B_DATA_OPT_OPT_1_SHIFT)

/*
 * OPT_0 (RW)
 *
 * 0: PLUS_MUL_1
 * 1: PLUS_MUL_2
 * 5: PLUS_DIV_2
 * 6: PLUS_DIV_3
 * 7: PLUS_DIV_4
 * 8: MINUS MUL 1
 * 9: MINUS MUL 2
 * 13: MINUS DIV 2
 * 14: MINUS DIV 3
 * 15: MINUS DIV 4
 */
#define VSC_VALUE_B_DATA_OPT_OPT_0_MASK (0xFU)
#define VSC_VALUE_B_DATA_OPT_OPT_0_SHIFT (0U)
#define VSC_VALUE_B_DATA_OPT_OPT_0_SET(x) (((uint32_t)(x) << VSC_VALUE_B_DATA_OPT_OPT_0_SHIFT) & VSC_VALUE_B_DATA_OPT_OPT_0_MASK)
#define VSC_VALUE_B_DATA_OPT_OPT_0_GET(x) (((uint32_t)(x) & VSC_VALUE_B_DATA_OPT_OPT_0_MASK) >> VSC_VALUE_B_DATA_OPT_OPT_0_SHIFT)

/* Bitfield definition for register: VALUE_C_DATA_OPT */
/*
 * OPT_3 (RW)
 *
 * 0: PLUS_MUL_1
 * 1: PLUS_MUL_2
 * 5: PLUS_DIV_2
 * 6: PLUS_DIV_3
 * 7: PLUS_DIV_4
 * 8: MINUS MUL 1
 * 9: MINUS MUL 2
 * 13: MINUS DIV 2
 * 14: MINUS DIV 3
 * 15: MINUS DIV 4
 */
#define VSC_VALUE_C_DATA_OPT_OPT_3_MASK (0xF000U)
#define VSC_VALUE_C_DATA_OPT_OPT_3_SHIFT (12U)
#define VSC_VALUE_C_DATA_OPT_OPT_3_SET(x) (((uint32_t)(x) << VSC_VALUE_C_DATA_OPT_OPT_3_SHIFT) & VSC_VALUE_C_DATA_OPT_OPT_3_MASK)
#define VSC_VALUE_C_DATA_OPT_OPT_3_GET(x) (((uint32_t)(x) & VSC_VALUE_C_DATA_OPT_OPT_3_MASK) >> VSC_VALUE_C_DATA_OPT_OPT_3_SHIFT)

/*
 * OPT_2 (RW)
 *
 * 0: PLUS_MUL_1
 * 1: PLUS_MUL_2
 * 5: PLUS_DIV_2
 * 6: PLUS_DIV_3
 * 7: PLUS_DIV_4
 * 8: MINUS MUL 1
 * 9: MINUS MUL 2
 * 13: MINUS DIV 2
 * 14: MINUS DIV 3
 * 15: MINUS DIV 4
 */
#define VSC_VALUE_C_DATA_OPT_OPT_2_MASK (0xF00U)
#define VSC_VALUE_C_DATA_OPT_OPT_2_SHIFT (8U)
#define VSC_VALUE_C_DATA_OPT_OPT_2_SET(x) (((uint32_t)(x) << VSC_VALUE_C_DATA_OPT_OPT_2_SHIFT) & VSC_VALUE_C_DATA_OPT_OPT_2_MASK)
#define VSC_VALUE_C_DATA_OPT_OPT_2_GET(x) (((uint32_t)(x) & VSC_VALUE_C_DATA_OPT_OPT_2_MASK) >> VSC_VALUE_C_DATA_OPT_OPT_2_SHIFT)

/*
 * OPT_1 (RW)
 *
 * 0: PLUS_MUL_1
 * 1: PLUS_MUL_2
 * 5: PLUS_DIV_2
 * 6: PLUS_DIV_3
 * 7: PLUS_DIV_4
 * 8: MINUS MUL 1
 * 9: MINUS MUL 2
 * 13: MINUS DIV 2
 * 14: MINUS DIV 3
 * 15: MINUS DIV 4
 */
#define VSC_VALUE_C_DATA_OPT_OPT_1_MASK (0xF0U)
#define VSC_VALUE_C_DATA_OPT_OPT_1_SHIFT (4U)
#define VSC_VALUE_C_DATA_OPT_OPT_1_SET(x) (((uint32_t)(x) << VSC_VALUE_C_DATA_OPT_OPT_1_SHIFT) & VSC_VALUE_C_DATA_OPT_OPT_1_MASK)
#define VSC_VALUE_C_DATA_OPT_OPT_1_GET(x) (((uint32_t)(x) & VSC_VALUE_C_DATA_OPT_OPT_1_MASK) >> VSC_VALUE_C_DATA_OPT_OPT_1_SHIFT)

/*
 * OPT_0 (RW)
 *
 * 0: PLUS_MUL_1
 * 1: PLUS_MUL_2
 * 5: PLUS_DIV_2
 * 6: PLUS_DIV_3
 * 7: PLUS_DIV_4
 * 8: MINUS MUL 1
 * 9: MINUS MUL 2
 * 13: MINUS DIV 2
 * 14: MINUS DIV 3
 * 15: MINUS DIV 4
 */
#define VSC_VALUE_C_DATA_OPT_OPT_0_MASK (0xFU)
#define VSC_VALUE_C_DATA_OPT_OPT_0_SHIFT (0U)
#define VSC_VALUE_C_DATA_OPT_OPT_0_SET(x) (((uint32_t)(x) << VSC_VALUE_C_DATA_OPT_OPT_0_SHIFT) & VSC_VALUE_C_DATA_OPT_OPT_0_MASK)
#define VSC_VALUE_C_DATA_OPT_OPT_0_GET(x) (((uint32_t)(x) & VSC_VALUE_C_DATA_OPT_OPT_0_MASK) >> VSC_VALUE_C_DATA_OPT_OPT_0_SHIFT)

/* Bitfield definition for register: VALUE_A_OFFSET */
/*
 * VALUE_A_OFFSET (RW)
 *
 * value_a offset
 */
#define VSC_VALUE_A_OFFSET_VALUE_A_OFFSET_MASK (0xFFFFFFFFUL)
#define VSC_VALUE_A_OFFSET_VALUE_A_OFFSET_SHIFT (0U)
#define VSC_VALUE_A_OFFSET_VALUE_A_OFFSET_SET(x) (((uint32_t)(x) << VSC_VALUE_A_OFFSET_VALUE_A_OFFSET_SHIFT) & VSC_VALUE_A_OFFSET_VALUE_A_OFFSET_MASK)
#define VSC_VALUE_A_OFFSET_VALUE_A_OFFSET_GET(x) (((uint32_t)(x) & VSC_VALUE_A_OFFSET_VALUE_A_OFFSET_MASK) >> VSC_VALUE_A_OFFSET_VALUE_A_OFFSET_SHIFT)

/* Bitfield definition for register: VALUE_B_OFFSET */
/*
 * VALUE_B_OFFSET (RW)
 *
 * value_b_offset
 */
#define VSC_VALUE_B_OFFSET_VALUE_B_OFFSET_MASK (0xFFFFFFFFUL)
#define VSC_VALUE_B_OFFSET_VALUE_B_OFFSET_SHIFT (0U)
#define VSC_VALUE_B_OFFSET_VALUE_B_OFFSET_SET(x) (((uint32_t)(x) << VSC_VALUE_B_OFFSET_VALUE_B_OFFSET_SHIFT) & VSC_VALUE_B_OFFSET_VALUE_B_OFFSET_MASK)
#define VSC_VALUE_B_OFFSET_VALUE_B_OFFSET_GET(x) (((uint32_t)(x) & VSC_VALUE_B_OFFSET_VALUE_B_OFFSET_MASK) >> VSC_VALUE_B_OFFSET_VALUE_B_OFFSET_SHIFT)

/* Bitfield definition for register: VALUE_C_OFFSET */
/*
 * VALUE_C_OFFSET (RW)
 *
 * value_c offset
 */
#define VSC_VALUE_C_OFFSET_VALUE_C_OFFSET_MASK (0xFFFFFFFFUL)
#define VSC_VALUE_C_OFFSET_VALUE_C_OFFSET_SHIFT (0U)
#define VSC_VALUE_C_OFFSET_VALUE_C_OFFSET_SET(x) (((uint32_t)(x) << VSC_VALUE_C_OFFSET_VALUE_C_OFFSET_SHIFT) & VSC_VALUE_C_OFFSET_VALUE_C_OFFSET_MASK)
#define VSC_VALUE_C_OFFSET_VALUE_C_OFFSET_GET(x) (((uint32_t)(x) & VSC_VALUE_C_OFFSET_VALUE_C_OFFSET_MASK) >> VSC_VALUE_C_OFFSET_VALUE_C_OFFSET_SHIFT)

/* Bitfield definition for register: IRQ_STATUS */
/*
 * IRQ_STATUS (RW)
 *
 * irq status bit:
 * bit0: vsc convert done irq.
 * bit1: in adc three-phase mode, if ABS(value_a+value_b+value_c) > adc_phase_tolerate, will trigger irq.
 * bit2: value_c overflow during capture process.
 * bit3: value_b_overflow during capture process.
 * bit4: value_a_overflow during capture process.
 * bit5: adc2 chan not capture enough adc value.
 * bit6: adc1 chan not capture enough adc value.
 * bit7: adc0 chan not capture enough adc value.
 * bit8: position not got valid before pos_wait_cycle timeout.
 * bit9: adc2 wait cycle timeout.
 * bit10: adc1 wait cycle timeout.
 * bit11: adc0 wait cycle timeout.
 * bit12: trigger_in break vsc convert even if adc or position is ready.
 */
#define VSC_IRQ_STATUS_IRQ_STATUS_MASK (0xFFFFFFFFUL)
#define VSC_IRQ_STATUS_IRQ_STATUS_SHIFT (0U)
#define VSC_IRQ_STATUS_IRQ_STATUS_SET(x) (((uint32_t)(x) << VSC_IRQ_STATUS_IRQ_STATUS_SHIFT) & VSC_IRQ_STATUS_IRQ_STATUS_MASK)
#define VSC_IRQ_STATUS_IRQ_STATUS_GET(x) (((uint32_t)(x) & VSC_IRQ_STATUS_IRQ_STATUS_MASK) >> VSC_IRQ_STATUS_IRQ_STATUS_SHIFT)

/* Bitfield definition for register: VALUE_A_SW */
/*
 * VALUE_A_SW (RW)
 *
 * value_a_sw
 */
#define VSC_VALUE_A_SW_VALUE_A_SW_MASK (0xFFFFFFFFUL)
#define VSC_VALUE_A_SW_VALUE_A_SW_SHIFT (0U)
#define VSC_VALUE_A_SW_VALUE_A_SW_SET(x) (((uint32_t)(x) << VSC_VALUE_A_SW_VALUE_A_SW_SHIFT) & VSC_VALUE_A_SW_VALUE_A_SW_MASK)
#define VSC_VALUE_A_SW_VALUE_A_SW_GET(x) (((uint32_t)(x) & VSC_VALUE_A_SW_VALUE_A_SW_MASK) >> VSC_VALUE_A_SW_VALUE_A_SW_SHIFT)

/* Bitfield definition for register: VALUE_B_SW */
/*
 * VALUE_B_SW (RW)
 *
 * value_b_sw
 */
#define VSC_VALUE_B_SW_VALUE_B_SW_MASK (0xFFFFFFFFUL)
#define VSC_VALUE_B_SW_VALUE_B_SW_SHIFT (0U)
#define VSC_VALUE_B_SW_VALUE_B_SW_SET(x) (((uint32_t)(x) << VSC_VALUE_B_SW_VALUE_B_SW_SHIFT) & VSC_VALUE_B_SW_VALUE_B_SW_MASK)
#define VSC_VALUE_B_SW_VALUE_B_SW_GET(x) (((uint32_t)(x) & VSC_VALUE_B_SW_VALUE_B_SW_MASK) >> VSC_VALUE_B_SW_VALUE_B_SW_SHIFT)

/* Bitfield definition for register: VALUE_C_SW */
/*
 * VALUE_C_SW (RW)
 *
 * value_c_sw
 */
#define VSC_VALUE_C_SW_VALUE_C_SW_MASK (0xFFFFFFFFUL)
#define VSC_VALUE_C_SW_VALUE_C_SW_SHIFT (0U)
#define VSC_VALUE_C_SW_VALUE_C_SW_SET(x) (((uint32_t)(x) << VSC_VALUE_C_SW_VALUE_C_SW_SHIFT) & VSC_VALUE_C_SW_VALUE_C_SW_MASK)
#define VSC_VALUE_C_SW_VALUE_C_SW_GET(x) (((uint32_t)(x) & VSC_VALUE_C_SW_VALUE_C_SW_MASK) >> VSC_VALUE_C_SW_VALUE_C_SW_SHIFT)

