hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_vsc_regs.h
/* Bitfield definition for register: VALUE_SW_READY */
/*
 * VALUE_SW_READY (W1C)
 *
 * software inject value_a/value_b/value_c ready
 */
#define VSC_VALUE_SW_READY_VALUE_SW_READY_MASK (0x1U)
#define VSC_VALUE_SW_READY_VALUE_SW_READY_SHIFT (0U)
#define VSC_VALUE_SW_READY_VALUE_SW_READY_SET(x) (((uint32_t)(x) << VSC_VALUE_SW_READY_VALUE_SW_READY_SHIFT) & VSC_VALUE_SW_READY_VALUE_SW_READY_MASK)
#define VSC_VALUE_SW_READY_VALUE_SW_READY_GET(x) (((uint32_t)(x) & VSC_VALUE_SW_READY_VALUE_SW_READY_MASK) >> VSC_VALUE_SW_READY_VALUE_SW_READY_SHIFT)

/* Bitfield definition for register: TRIGGER_SW */
/*
 * TRIGGER_SW (W1C)
 *
 * software trigger to start waiting adc capture value, same as hardwire trigger_in
 */
#define VSC_TRIGGER_SW_TRIGGER_SW_MASK (0x1U)
#define VSC_TRIGGER_SW_TRIGGER_SW_SHIFT (0U)
#define VSC_TRIGGER_SW_TRIGGER_SW_SET(x) (((uint32_t)(x) << VSC_TRIGGER_SW_TRIGGER_SW_SHIFT) & VSC_TRIGGER_SW_TRIGGER_SW_MASK)
#define VSC_TRIGGER_SW_TRIGGER_SW_GET(x) (((uint32_t)(x) & VSC_TRIGGER_SW_TRIGGER_SW_MASK) >> VSC_TRIGGER_SW_TRIGGER_SW_SHIFT)

/* Bitfield definition for register: TIMELOCK */
/*
 * POSITION_CAPTURE_MODE (RW)
 *
 * postion capture mode:
 * 00: position use last valid data when adc value capture finish
 * 01: position use frist valid data after adc value capture
 * 10: position use last valid data before adc value capture
 * other: reserved
 */
#define VSC_TIMELOCK_POSITION_CAPTURE_MODE_MASK (0x3000U)
#define VSC_TIMELOCK_POSITION_CAPTURE_MODE_SHIFT (12U)
#define VSC_TIMELOCK_POSITION_CAPTURE_MODE_SET(x) (((uint32_t)(x) << VSC_TIMELOCK_POSITION_CAPTURE_MODE_SHIFT) & VSC_TIMELOCK_POSITION_CAPTURE_MODE_MASK)
#define VSC_TIMELOCK_POSITION_CAPTURE_MODE_GET(x) (((uint32_t)(x) & VSC_TIMELOCK_POSITION_CAPTURE_MODE_MASK) >> VSC_TIMELOCK_POSITION_CAPTURE_MODE_SHIFT)

/*
 * ADC_TIMESTAMP_SEL (RW)
 *
 * adc timestamp select：
 * 0：reserved;
 * 1: from value_a;
 * 2: from value_b;
 * 3: from value_c;
 */
#define VSC_TIMELOCK_ADC_TIMESTAMP_SEL_MASK (0x30U)
#define VSC_TIMELOCK_ADC_TIMESTAMP_SEL_SHIFT (4U)
#define VSC_TIMELOCK_ADC_TIMESTAMP_SEL_SET(x) (((uint32_t)(x) << VSC_TIMELOCK_ADC_TIMESTAMP_SEL_SHIFT) & VSC_TIMELOCK_ADC_TIMESTAMP_SEL_MASK)
#define VSC_TIMELOCK_ADC_TIMESTAMP_SEL_GET(x) (((uint32_t)(x) & VSC_TIMELOCK_ADC_TIMESTAMP_SEL_MASK) >> VSC_TIMELOCK_ADC_TIMESTAMP_SEL_SHIFT)

/*
 * VALUE_COUNTER_SEL (RW)
 *
 * adc timestamp use which number index of adc_timestamp_sel used.
 */
#define VSC_TIMELOCK_VALUE_COUNTER_SEL_MASK (0xFU)
#define VSC_TIMELOCK_VALUE_COUNTER_SEL_SHIFT (0U)
#define VSC_TIMELOCK_VALUE_COUNTER_SEL_SET(x) (((uint32_t)(x) << VSC_TIMELOCK_VALUE_COUNTER_SEL_SHIFT) & VSC_TIMELOCK_VALUE_COUNTER_SEL_MASK)
#define VSC_TIMELOCK_VALUE_COUNTER_SEL_GET(x) (((uint32_t)(x) & VSC_TIMELOCK_VALUE_COUNTER_SEL_MASK) >> VSC_TIMELOCK_VALUE_COUNTER_SEL_SHIFT)

/* Bitfield definition for register: POSITION_SW */
/*
 * POSITION_SW (RW)
 *
 * position_sw
 */
#define VSC_POSITION_SW_POSITION_SW_MASK (0xFFFFFFFFUL)
#define VSC_POSITION_SW_POSITION_SW_SHIFT (0U)
#define VSC_POSITION_SW_POSITION_SW_SET(x) (((uint32_t)(x) << VSC_POSITION_SW_POSITION_SW_SHIFT) & VSC_POSITION_SW_POSITION_SW_MASK)
#define VSC_POSITION_SW_POSITION_SW_GET(x) (((uint32_t)(x) & VSC_POSITION_SW_POSITION_SW_MASK) >> VSC_POSITION_SW_POSITION_SW_SHIFT)

/* Bitfield definition for register: ADC_WAIT_CYCLE */
/*
 * ADC_WAIT_CYCLE (RW)
 *
 * adc wait cycle after trigger adc capture event
 */
#define VSC_ADC_WAIT_CYCLE_ADC_WAIT_CYCLE_MASK (0xFFFFFFFFUL)
#define VSC_ADC_WAIT_CYCLE_ADC_WAIT_CYCLE_SHIFT (0U)
#define VSC_ADC_WAIT_CYCLE_ADC_WAIT_CYCLE_SET(x) (((uint32_t)(x) << VSC_ADC_WAIT_CYCLE_ADC_WAIT_CYCLE_SHIFT) & VSC_ADC_WAIT_CYCLE_ADC_WAIT_CYCLE_MASK)
#define VSC_ADC_WAIT_CYCLE_ADC_WAIT_CYCLE_GET(x) (((uint32_t)(x) & VSC_ADC_WAIT_CYCLE_ADC_WAIT_CYCLE_MASK) >> VSC_ADC_WAIT_CYCLE_ADC_WAIT_CYCLE_SHIFT)

/* Bitfield definition for register: POS_WAIT_CYCLE */
/*
 * POS_WAIT_CYCLE (RW)
 *
 * position wait cycle after trigger adc capture event
 */
#define VSC_POS_WAIT_CYCLE_POS_WAIT_CYCLE_MASK (0xFFFFFFFFUL)
#define VSC_POS_WAIT_CYCLE_POS_WAIT_CYCLE_SHIFT (0U)
#define VSC_POS_WAIT_CYCLE_POS_WAIT_CYCLE_SET(x) (((uint32_t)(x) << VSC_POS_WAIT_CYCLE_POS_WAIT_CYCLE_SHIFT) & VSC_POS_WAIT_CYCLE_POS_WAIT_CYCLE_MASK)
#define VSC_POS_WAIT_CYCLE_POS_WAIT_CYCLE_GET(x) (((uint32_t)(x) & VSC_POS_WAIT_CYCLE_POS_WAIT_CYCLE_MASK) >> VSC_POS_WAIT_CYCLE_POS_WAIT_CYCLE_SHIFT)

/* Bitfield definition for register: IRQ_ENABLE */
/*
 * IRQ_ENABLE (RW)
 *
 * irq enable bit:
 * bit0: vsc convert done irq.
 * bit1: in adc three-phase mode, if ABS(value_a+value_b+value_c) > adc_phase_tolerate, will trigger irq.
 * bit2: value_c overflow during capture process.
 * bit3: value_b_overflow during capture process.
 * bit4: value_a_overflow during capture process.
 * bit5: adc2 chan not capture enough adc value.
 * bit6: adc1 chan not capture enough adc value.
 * bit7: adc0 chan not capture enough adc value.
 * bit8: position not got valid before pos_wait_cycle timeout.
 * bit9: adc2 wait cycle timeout.
 * bit10: adc1 wait cycle timeout.
 * bit11: adc0 wait cycle timeout.
 * bit12: trigger_in break vsc convert even if adc or position is ready.
 */
#define VSC_IRQ_ENABLE_IRQ_ENABLE_MASK (0xFFFFFFFFUL)
#define VSC_IRQ_ENABLE_IRQ_ENABLE_SHIFT (0U)
#define VSC_IRQ_ENABLE_IRQ_ENABLE_SET(x) (((uint32_t)(x) << VSC_IRQ_ENABLE_IRQ_ENABLE_SHIFT) & VSC_IRQ_ENABLE_IRQ_ENABLE_MASK)
#define VSC_IRQ_ENABLE_IRQ_ENABLE_GET(x) (((uint32_t)(x) & VSC_IRQ_ENABLE_IRQ_ENABLE_MASK) >> VSC_IRQ_ENABLE_IRQ_ENABLE_SHIFT)

/* Bitfield definition for register: ADC_PHASE_TOLERATE */
/*
 * ADC_PHASE_TOLERATE (RW)
 *
 * in adc three-phase mode, if ABS(value_a+value_b+value_c) > adc_phase_tolerate, will trigger irq.
 */
#define VSC_ADC_PHASE_TOLERATE_ADC_PHASE_TOLERATE_MASK (0xFFFFFFFFUL)
#define VSC_ADC_PHASE_TOLERATE_ADC_PHASE_TOLERATE_SHIFT (0U)
#define VSC_ADC_PHASE_TOLERATE_ADC_PHASE_TOLERATE_SET(x) (((uint32_t)(x) << VSC_ADC_PHASE_TOLERATE_ADC_PHASE_TOLERATE_SHIFT) & VSC_ADC_PHASE_TOLERATE_ADC_PHASE_TOLERATE_MASK)
#define VSC_ADC_PHASE_TOLERATE_ADC_PHASE_TOLERATE_GET(x) (((uint32_t)(x) & VSC_ADC_PHASE_TOLERATE_ADC_PHASE_TOLERATE_MASK) >> VSC_ADC_PHASE_TOLERATE_ADC_PHASE_TOLERATE_SHIFT)

